{
  "News": [
    {
      "Date": "2025-06-27T12:50:00Z",
      "Number": "100001",
      "ShortTitle": "TOU: Mira v1.0.0",
      "SubTitle": "Initial Release!",
      "Title": "Town of Us: Mira v1.0.0",
      "Text":
      [
        "\n\n\r<b> The initial release!</b>",
        "\n\n★ Welcome to Town of Us: Mira <link=https://github.com/AU-Avengers/TOU-Mira/releases/tag/v1.0.0>v1.0.0</link> ★",
        "\n\n THIS MOD IS IN PUBLIC BETA. EXPECT BUGS AND ISSUES."
      ]
    },
    {
      "Date": "2025-06-30T12:50:00Z",
      "Number": "100002",
      "ShortTitle": "TOU: Mira v1.0.1",
      "SubTitle": "Many Bugfixes!",
      "Title": "Town of Us: Mira v1.0.1",
      "Text":
      [
        "\n\n\r<b> Update now Available!</b>",
        "\n\n★ Welcome to Town of Us: Mira <link=https://github.com/AU-Avengers/TOU-Mira/releases/tag/v1.0.1>v1.0.1</link> ★",
        "\n\n\r<size=105%>Crewmate Role Bugfixes:</size>",
        "\n- Detective report settings are now toggled correctly",
        "\n- Haunter can open Decontam doors again!",
        "\n- Investigator footprints are hidden in comms sabotage",
        "\n- Prosecutor's prosecution is always anonymous",
        "\n- Prosecutor can no longer pros the skip button",
        "\n- If you are jailed and your Jailor dies mid-meeting, your messages are not displaced into public chat",
        "\n- Altruist revives dead lovers properly",
        "\n- Imitator Mayor no longer reveals themselves to the crew as Imitator",
        "\n- Imitator role change rpc has been fixed, shouldn't result in errors anymore",
        "\n\n\r<size=105%>Neutral Role Bugfixes</size>",
        "\n- Inquisitor checks if all their targets have died to determine if the game will end or not",
        "\n- Inquisitor Inquire uses no longer drain if someone was picked during the round already",
        "\n- Inquisitor report no longer duplicates the last role",
        "\n- Phantom will spawn correctly if Haunter failed to spawn",
        "\n- Phantom can open Decontam doors again!",
        "\n- Soul Collected players will now hide in comms correctly",
        "\n\n\r<size=105%>Impostor Role Bugfixes</size>",
        "\n- A player that's destined to become Traitor no longer holds the game if they are dead",
        "\n\r<size=105%>Modifier Bugfixes</size>",
        "\n- Celebrity no longer sends a report message when they are exiled",
        "\n- In Freeplay, removing the Shy modifier no longer keeps your player or pet invisible",
        "\n- Multitasker no longer makes security minigames transparent",
        "\n\n\r<size=105%>Other Bugfixes</size>",
        "\n- Spamming to join into a lobby is no longer possible and will not queue a join attempt repeatedly",
        "\n- Zooming in freeplay no longer shows broken shadows, instead opting to hide them",
        "\n- Messages with 0 characters will no longer be parsed through private chats",
        "\n- Long mode no longer trips up the game",
        "\n\n\r<size=105%>Improvements</size>",
        "\n- The <b>/setname</b> command now has a limit of 12 characters and removes tmp text",
        "\n- Lovers chatbox is hidden in the exile screen",
        "\n- Colorblind text is now always capitalized in all menus",
        "\n- Tawny and Gold color names have been swapped around",
        "\n- More errors have been cleared up, so there will be less filler in logs and the game will be smoother",
        "\n- Wiki hides the host player UI in the lobby",
        "\n\n\r<size=105%>Additions</size>",
        "\n- Jailee Can Use Public Chat toggle",
        "\n- New Colors!",
        "\n- Long Horse April Fools (<b>Long and Long Horse have issues with cosmetics, be aware of this</b>)",
        "\n\n\r<size=105%>Removals</size>",
        "\n- <b>/sethost</b> command is being removed as it just causes trouble"
        ]
    }
  ]
}
