{
  "News": [
    {
      "Date": "2025-06-27T12:50:00Z",
      "Number": "100001",
      "ShortTitle": "TOU: Mira v1.0.0",
      "SubTitle": "Initial Release!",
      "Title": "Town of Us: Mira v1.0.0",
      "Text": [
        "\r<b> The initial release!</b>",
        "\n\n★ <link=https://github.com/AU-Avengers/TOU-Mira/releases/tag/v1.0.0>TOU Mira v1.0.0 Download</link> ★ <link=https://au-avengers.github.io/docs.toum.gg/>Mod Guide & Details</link> ★",
        "\n\n THIS MOD IS IN PUBLIC BETA. EXPECT BUGS AND ISSUES."
      ]
    },
    {
      "Date": "2025-06-30T12:50:00Z",
      "Number": "100002",
      "ShortTitle": "TOU: Mira v1.0.1",
      "SubTitle": "Many Bugfixes!",
      "Title": "Town of Us: Mira v1.0.1",
      "Text": [
        "\r<b> Update now Available!</b>",
        "\n\n★ <link=https://github.com/AU-Avengers/TOU-Mira/releases/tag/v1.0.1>TOU Mira v1.0.1 Download</link> ★ <link=https://au-avengers.github.io/docs.toum.gg/>Mod Guide & Details</link> ★",
        "\n\n\r<size=105%>Crewmate Role Bugfixes:</size>",
        "\n- Detective report settings are now toggled correctly",
        "\n- Haunter can open Decontam doors again!",
        "\n- Investigator footprints are hidden in comms sabotage",
        "\n- Prosecutor's prosecution is always anonymous",
        "\n- Prosecutor can no longer pros the skip button",
        "\n- If you are jailed and your Jailor dies mid-meeting, your messages are not displaced into public chat",
        "\n- Altruist revives dead lovers properly",
        "\n- Imitator Mayor no longer reveals themselves to the crew as Imitator",
        "\n- Imitator role change rpc has been fixed, shouldn't result in errors anymore",
        "\n- Medium arrows are removed after a meeting",
        "\n\n\r<size=105%>Neutral Role Bugfixes</size>",
        "\n- Inquisitor checks if all their targets have died to determine if the game will end or not",
        "\n- Inquisitor Inquire uses no longer drain if someone was picked during the round already",
        "\n- Inquisitor report no longer duplicates the last role",
        "\n- Phantom will spawn correctly if Haunter failed to spawn",
        "\n- Phantom can open Decontam doors again!",
        "\n- Soul Collected players will now hide in comms correctly",
        "\n\n\r<size=105%>Impostor Role Bugfixes</size>",
        "\n- A player that's destined to become Traitor no longer holds the game if they are dead",
        "\n\r<size=105%>Modifier Bugfixes</size>",
        "\n- Celebrity no longer sends a report message when they are exiled",
        "\n- In Freeplay, removing the Shy modifier no longer keeps your player or pet invisible",
        "\n- Multitasker no longer makes security minigames transparent",
        "\n- Lovers die together and revive together correctly",
        "\n\n\r<size=105%>Other Bugfixes</size>",
        "\n- Spamming to join into a lobby is no longer possible and will not queue a join attempt repeatedly",
        "\n- Zooming in freeplay no longer shows broken shadows, instead opting to hide them",
        "\n- Messages with 0 characters will no longer be parsed through private chats",
        "\n- Long mode no longer trips up the game",
        "\n\n\r<size=105%>Improvements</size>",
        "\n- The <b>/setname</b> command now has a limit of 12 characters and removes tmp text",
        "\n- Lovers chatbox is hidden in the exile screen",
        "\n- Colorblind text is now always capitalized in all menus",
        "\n- Tawny and Gold color names have been swapped around",
        "\n- More errors have been cleared up, so there will be less filler in logs and the game will be smoother",
        "\n- Wiki hides the host player UI in the lobby",
        "\n\n\r<size=105%>Additions</size>",
        "\n- Jailee Can Use Public Chat toggle",
        "\n- New Colors!",
        "\n- Long Horse April Fools (<b>Long and Long Horse have issues with cosmetics, be aware of this</b>)",
        "\n\n\r<size=105%>Removals</size>",
        "\n- <b>/sethost</b> command is being removed as it just causes trouble"
      ]
    },
    {
      "Date": "2025-07-04T12:50:00Z",
      "Number": "100003",
      "ShortTitle": "TOU: Mira v1.0.2",
      "SubTitle": "Bugfixes and Improvements galore!",
      "Title": "Town of Us: Mira v1.0.2",
      "Text": [
        "\r<b> Update now Available!</b>",
        "\n\nThis update includes numerous bugfixes and improvements, and should hopefully clear up the recent crashes happening on Epic Games. As always, if you encounter a bug, feel free to make a bug report!",
        "\n\n★ <link=https://github.com/AU-Avengers/TOU-Mira/releases/tag/v1.0.2>TOU Mira v1.0.2 Download</link> ★ <link=https://au-avengers.github.io/docs.toum.gg/>Mod Guide & Details</link> ★",
        "\n\n\r<size=105%>Crewmate Role Bugfixes:</size>",
        "\n- Investigator footprints hide in comms properly and no longer error out",
        "\n- Deputy camped notification should be sent to the correct player now",
        "\n- Sheriff correct kills are checked correctly",
        "\n- Sheriff no longer continues the game on misfire",
        "\n- <b>Jailee Can't Use Public Chat</b> option has been fixed",
        "\n- Prosecutor continues game",
        "\n- Infinite Engineer vent uses no longer shows uses as <b>0</b>",
        "\n- Imitator should no longer be able to change roles if they have turned vamp or traitor",
        "\n- Engineer/Plumber can no longer access vents through walls",
        "\n- Amnesiac and Imitator no longer interfere when selecting roles",
        "\n\n\r<size=105%>Neutral Role Bugfixes:</size>",
        "\n- Pestilence has impostor vision now",
        "\n- Hacking a player should no longer affect meeting or ejection screen kills",
        "\n\n\r<size=105%>Impostor Role Bugfixes:</size>",
        "\n- Hypnotised players should no longer be able to see player names",
        "\n- Dead traitor should no longer be able to change their role",
        "\n\n\r<size=105%>Modifier Bugfixes:</size>",
        "\n- Shy no longer applies onto Phantom/Haunter",
        "\n- Egotist can no longer be traitor",
        "\n- Egotist cannot leave the game if lovers are alive",
        "\n- Egotists no longer show correct or incorrect kills",
        "\n\n\r<size=105%>Other Bugfixes:</size>",
        "\n- Vent offset no longer shows a timer",
        "\n- If impostors cannot see each others' roles but know who they are, they can see each other in the team reveal properly",
        "\n\n\r<size=105%>Improvements:</size>",
        "\n- Cleric now tells you if the player you cleansed had no negative effects",
        "\n- Task count is shown on the Taskbar tab itself",
        "\n- Faction/Team modifiers are shown below role description in the role reveal screen",
        "\n- Satellite now shows dead bodies on the map",
        "\n- Tracker arrow delay and Shy options can go down to zero seconds",
        "\n- End Game Timer options can go up to 30 minutes",
        "\n- Sheriff Shoot, Button Barry, and Satellite Broadcast can be used immediately in Freeplay regardless of Round One settings",
        "\n- Meeting kill animations are instant when there's less than 6 players",
        "\n- End Game checks were moved around and should fix crashes on Epic Games",
        "\n\n\r<size=105%>Additions:</size>",
        "\n- End Game Timer now allows switching between <b>Game Draw</b> and <b>Impostor Win</b> on the timer ending",
        "\n- Scavenger now gets a HnS-like pop-up for their next target",
        "\n- Amnesiac gives feedback and will notify you when trying to remember Amnesiac",
        "\n- Better Airship options",
        "\n- Arrow Style option: Toggle between the default look, the arrow with a dark glow, a color glow, or use the old task arrows if you wish",
        "\n\n\r<size=105%>Changes:</size>",
        "\n- Inquisitor's <b>Stall Game</b> option is now only applicable in 1v1s or 2v1s",
        "\n- Assassin's <b>Guess Spy / Investigator Modifier</b> options are now merged into one option that includes all Crewmate Utility Modifiers in general",
        "\n- Just like in TOUR, all button timers will now pause in vents (besides Glitch's buttons)",
        "\n- Imitator can no longer pick up Politician or Mayor (because they can stay as those roles forever)"
      ]
    }
  ]
}
